[
    {
        "index": 1,
        "category": "Puzzle",
        "question": "You have six horses and want to race them to see which is fastest. What is the best way to do this?",
        "human_answer": "Race them on a single race track with at least six lanes - the order in which they cross the finish line determines which is the fastest."
    },
    {
        "index": 2,
        "category": "Counting",
        "question": "A robot has 8 arms. There are 5 objects on a table: a knife, a fork, a spoon, a teddy bear and a doll. The robot picks up each object with an arm. He then shakes hands with himself. How many arms does he have free?",
        "human_answer": "A hand is used for each of the five objects and then two hands are used to shake hands with himself. This means that seven hands are being used, leaving one arm/hand free."
    },
    {
        "index": 3,
        "category": "Spatial",
        "question": "Alan, Bob, Colin, Dave and Emily are standing in a circle. Alan is on Bob's immediate left. Bob is on Colin's immediate left. Colin is on Dave's immediate left. Dave is on Emily's immediate left. Who is on Alan's immediate right?",
        "human_answer": "Bob is on Alan's immediate right because it is stated that Alan is on Bob's immediate left."
    },
    {
        "index": 4,
        "category": "Linguistic",
        "question": "Write me a sentence without any words that appear in The Bible.",
        "human_answer": "Cryptographic algorithms safeguard nuclear warheads."
    },
    {
        "index": 5,
        "category": "Popular science",
        "question": "Which weighs more, a pound of water, two pounds of bricks, a pound of feathers, or three pounds of air.",
        "human_answer": "Three pounds of air."
    },
    {
        "index": 6,
        "category": "Relational",
        "question": "I get out on the top floor (third floor) at street level. How many stories is the building above the ground",
        "human_answer": "One story above the ground"
    }
]

